insert into employees(account, company_number, email, first_name, hiring_date, identification, identificator_1c,
                      information, last_name, middle_name, mobile_number, password, position, role, username,
                      vacation_days_available, vacation_days_earned, vacation_days_used, work_office, work_place, department_id)
VALUES
    ('acc001', '100001', 'ivan.petrov1@example.com', 'Иван', '2018-05-12', 'A000001', '1C0001',
     'Автосгенерированный сотрудник', 'Петров', 'Иванович', '+996500000001', 'pass01', 'Программист', 'USER', 'user01',
     12, 24, 12, '112', 'Главный офис', 1),

    ('acc002', '100002', 'olga.smirnova2@example.com', 'Ольга', '2019-07-23', 'A000002', '1C0002',
     'Автосгенерированный сотрудник', 'Смирнова', 'Петровна', '+996500000002', 'pass02', 'HR-менеджер', 'USER', 'user02',
     18, 25, 7, '101', 'HR офис', 2),

    ('acc003', '100003', 'dmitry.sidorov3@example.com', 'Дмитрий', '2020-03-15', 'A000003', '1C0003',
     'Автосгенерированный сотрудник', 'Сидоров', 'Алексеевич', '+996500000003', 'pass03', 'Аналитик', 'USER', 'user03',
     20, 28, 8, '203', 'Финансовый корпус', 3),

    ('acc004', '100004', 'natalia.kuznetsova4@example.com', 'Наталья', '2017-11-01', 'A000004', '1C0004',
     'Автосгенерированный сотрудник', 'Кузнецова', 'Игоревна', '+996500000004', 'pass04', 'Бухгалтер', 'USER', 'user04',
     10, 20, 10, '204', 'Бухгалтерия', 4),

    ('acc005', '100005', 'aidar.tokoev5@example.com', 'Айдар', '2021-02-10', 'A000005', '1C0005',
     'Автосгенерированный сотрудник', 'Токоев', 'Маратович', '+996500000005', 'pass05', 'Системный администратор', 'USER', 'user05',
     15, 25, 10, '220', 'IT-отдел', 1),

    ('acc006', '100006', 'alexander.ivanov6@example.com', 'Александр', '2016-09-19', 'A000006', '1C0006',
     'Автосгенерированный сотрудник', 'Иванов', 'Денисович', '+996500000006', 'pass06', 'DevOps инженер', 'USER', 'user06',
     10, 22, 12, '115', 'Отдел DevOps', 12),

    ('acc007', '100007', 'elena.popova7@example.com', 'Елена', '2022-01-08', 'A000007', '1C0007',
     'Автосгенерированный сотрудник', 'Попова', 'Сергеевна', '+996500000007', 'pass07', 'PR менеджер', 'USER', 'user07',
     14, 20, 6, '310', 'PR-отдел', 19),

    ('acc008', '100008', 'sergey.egorov8@example.com', 'Сергей', '2015-03-28', 'A000008', '1C0008',
     'Автосгенерированный сотрудник', 'Егоров', 'Васильевич', '+996500000008', 'pass08', 'Начальник склада', 'USER', 'user08',
     12, 25, 13, '130', 'Склад', 15),

    ('acc009', '100009', 'svetlana.kozlova9@example.com', 'Светлана', '2018-10-10', 'A000009', '1C0009',
     'Автосгенерированный сотрудник', 'Козлова', 'Юрьевна', '+996500000009', 'pass09', 'Менеджер по продажам', 'USER', 'user09',
     18, 27, 9, '102', 'Продажи', 5),

    ('acc010', '100010', 'timur.umarov10@example.com', 'Тимур', '2020-06-17', 'A000010', '1C0010',
     'Автосгенерированный сотрудник', 'Умаров', 'Фархатович', '+996500000010', 'pass10', 'Аналитик данных', 'USER', 'user10',
     20, 30, 10, '305', 'Аналитика', 13),

    ('acc011', '100011', 'anastasia.morozova11@example.com', 'Анастасия', '2019-12-01', 'A000011', '1C0011',
     'Автосгенерированный сотрудник', 'Морозова', 'Ильинична', '+996500000011', 'pass11', 'Юрисконсульт', 'USER', 'user11',
     15, 25, 10, '108', 'Юридический отдел', 6),

    ('acc012', '100012', 'konstantin.lebedev12@example.com', 'Константин', '2023-03-05', 'A000012', '1C0012',
     'Автосгенерированный сотрудник', 'Лебедев', 'Георгиевич', '+996500000012', 'pass12', 'Тестировщик', 'USER', 'user12',
     12, 20, 8, '211', 'QA отдел', 11),

    ('acc013', '100013', 'maria.sokolova13@example.com', 'Мария', '2017-08-14', 'A000013', '1C0013',
     'Автосгенерированный сотрудник', 'Соколова', 'Владимировна', '+996500000013', 'pass13', 'Рекрутер', 'USER', 'user13',
     10, 20, 10, '109', 'HR', 2),

    ('acc014', '100014', 'rustam.karimov14@example.com', 'Рустам', '2016-04-21', 'A000014', '1C0014',
     'Автосгенерированный сотрудник', 'Каримов', 'Нурланович', '+996500000014', 'pass14', 'IT инженер', 'USER', 'user14',
     17, 26, 9, '117', 'IT центр', 1),

    ('acc015', '100015', 'olga.ermakova15@example.com', 'Ольга', '2015-11-03', 'A000015', '1C0015',
     'Автосгенерированный сотрудник', 'Ермакова', 'Семеновна', '+996500000015', 'pass15', 'Финансовый аналитик', 'USER', 'user15',
     16, 25, 9, '215', 'Финансы', 3),

    ('acc016', '100016', 'pavel.volkov16@example.com', 'Павел', '2014-01-29', 'A000016', '1C0016',
     'Автосгенерированный сотрудник', 'Волков', 'Артурович', '+996500000016', 'pass16', 'Оператор', 'USER', 'user16',
     15, 24, 9, '120', 'Операционный отдел', 14),

    ('acc017', '100017', 'yulia.fedorova17@example.com', 'Юлия', '2019-09-12', 'A000017', '1C0017',
     'Автосгенерированный сотрудник', 'Федорова', 'Николаевна', '+996500000017', 'pass17', 'Планировщик', 'USER', 'user17',
     13, 20, 7, '122', 'Планирование', 21),

    ('acc018', '100018', 'arman.toktoshev18@example.com', 'Арман', '2022-02-18', 'A000018', '1C0018',
     'Автосгенерированный сотрудник', 'Токтошев', 'Бекназарович', '+996500000018', 'pass18', 'DevOps инженер', 'USER', 'user18',
     19, 27, 8, '212', 'DevOps', 12),

    ('acc019', '100019', 'vera.kuzina19@example.com', 'Вера', '2020-10-25', 'A000019', '1C0019',
     'Автосгенерированный сотрудник', 'Кузина', 'Павловна', '+996500000019', 'pass19', 'Секретарь', 'USER', 'user19',
     12, 22, 10, '101', 'Секретариат', 25),

    ('acc020', '100020', 'nursultan.abdykadyrov20@example.com', 'Нурсултан', '2021-04-04', 'A000020', '1C0020',
     'Автосгенерированный сотрудник', 'Абдыкадыров', 'Уланович', '+996500000020', 'pass20', 'Офис-менеджер', 'USER', 'user20',
     14, 24, 10, '103', 'Офис', 24),

    ('acc021', '100021', 'diana.belyaeva21@example.com', 'Диана', '2017-06-13', 'A000021', '1C0021',
    'Автосгенерированный сотрудник', 'Беляева', 'Ивановна', '+996500000021', 'pass21', 'Маркетолог', 'USER', 'user21',
    12, 22, 10, '104', 'Маркетинг', 7),

    ('acc022', '100022', 'igor.konovalov22@example.com', 'Игорь', '2018-08-07', 'A000022', '1C0022',
    'Автосгенерированный сотрудник', 'Коновалов', 'Сергеевич', '+996500000022', 'pass22', 'Руководитель проекта', 'USER', 'user22',
    15, 25, 10, '118', 'Проектный офис', 9),

    ('acc023', '100023', 'ludmila.ivanova23@example.com', 'Людмила', '2019-02-20', 'A000023', '1C0023',
    'Автосгенерированный сотрудник', 'Иванова', 'Петровна', '+996500000023', 'pass23', 'Экономист', 'USER', 'user23',
    13, 21, 8, '130', 'Экономический отдел', 16),

    ('acc024', '100024', 'maxim.cherkasov24@example.com', 'Максим', '2020-11-11', 'A000024', '1C0024',
    'Автосгенерированный сотрудник', 'Черкасов', 'Андреевич', '+996500000024', 'pass24', 'Инженер', 'USER', 'user24',
    14, 23, 9, '210', 'Инженерный отдел', 20),

    ('acc025', '100025', 'svetlana.belova25@example.com', 'Светлана', '2021-05-05', 'A000025', '1C0025',
    'Автосгенерированный сотрудник', 'Белова', 'Николаевна', '+996500000025', 'pass25', 'Аналитик', 'USER', 'user25',
    15, 26, 11, '215', 'Аналитический отдел', 13),

    ('acc026', '100026', 'nikolay.kirillov26@example.com', 'Николай', '2017-09-17', 'A000026', '1C0026',
    'Автосгенерированный сотрудник', 'Кириллов', 'Павлович', '+996500000026', 'pass26', 'Системный аналитик', 'USER', 'user26',
    12, 22, 10, '118', 'Аналитика', 13),

    ('acc027', '100027', 'anna.orlova27@example.com', 'Анна', '2018-12-08', 'A000027', '1C0027',
    'Автосгенерированный сотрудник', 'Орлова', 'Александровна', '+996500000027', 'pass27', 'Менеджер проектов', 'USER', 'user27',
    14, 24, 10, '119', 'Проектный отдел', 9),

    ('acc028', '100028', 'dmitry.volkov28@example.com', 'Дмитрий', '2019-03-22', 'A000028', '1C0028',
    'Автосгенерированный сотрудник', 'Волков', 'Игоревич', '+996500000028', 'pass28', 'Инженер поддержки', 'USER', 'user28',
    13, 22, 9, '120', 'Техническая поддержка', 14),

    ('acc029', '100029', 'irina.kovaleva29@example.com', 'Ирина', '2020-07-30', 'A000029', '1C0029',
    'Автосгенерированный сотрудник', 'Ковалева', 'Викторовна', '+996500000029', 'pass29', 'Бухгалтер', 'USER', 'user29',
    15, 26, 11, '204', 'Бухгалтерия', 4),

    ('acc030', '100030', 'oleg.nikolaev30@example.com', 'Олег', '2021-01-14', 'A000030', '1C0030',
    'Автосгенерированный сотрудник', 'Николаев', 'Сергеевич', '+996500000030', 'pass30', 'IT специалист', 'USER', 'user30',
    12, 22, 10, '220', 'IT отдел', 1),

    ('acc031', '100031', 'yulia.makarova31@example.com', 'Юлия', '2018-05-19', 'A000031', '1C0031',
    'Автосгенерированный сотрудник', 'Макарова', 'Александровна', '+996500000031', 'pass31', 'HR менеджер', 'USER', 'user31',
    14, 24, 10, '109', 'HR отдел', 2),

    ('acc032', '100032', 'maxim.sidorov32@example.com', 'Максим', '2019-11-23', 'A000032', '1C0032',
    'Автосгенерированный сотрудник', 'Сидоров', 'Дмитриевич', '+996500000032', 'pass32', 'Разработчик', 'USER', 'user32',
    15, 25, 10, '112', 'Отдел разработки', 1),

    ('acc033', '100033', 'elena.nikitina33@example.com', 'Елена', '2017-03-28', 'A000033', '1C0033',
    'Автосгенерированный сотрудник', 'Никитина', 'Владимировна', '+996500000033', 'pass33', 'Маркетолог', 'USER', 'user33',
    12, 22, 10, '104', 'Маркетинг', 7),

    ('acc034', '100034', 'ivan.pavlov34@example.com', 'Иван', '2020-10-12', 'A000034', '1C0034',
    'Автосгенерированный сотрудник', 'Павлов', 'Сергеевич', '+996500000034', 'pass34', 'Инженер', 'USER', 'user34',
    13, 23, 10, '210', 'Инженерный отдел', 20),

    ('acc035', '100035', 'irina.lebedeva35@example.com', 'Ирина', '2021-06-30', 'A000035', '1C0035',
    'Автосгенерированный сотрудник', 'Лебедева', 'Игоревна', '+996500000035', 'pass35', 'Экономист', 'USER', 'user35',
    14, 25, 11, '130', 'Экономический отдел', 16),

    ('acc036', '100036', 'pavel.kuznetsov36@example.com', 'Павел', '2018-07-15', 'A000036', '1C0036',
     'Автосгенерированный сотрудник', 'Кузнецов', 'Алексеевич', '+996500000036', 'pass36', 'Специалист по закупкам', 'USER', 'user36',
     15, 25, 10, '107', 'Закупки', 8),

    ('acc037', '100037', 'nataliya.gromova37@example.com', 'Наталья', '2019-04-20', 'A000037', '1C0037',
     'Автосгенерированный сотрудник', 'Громова', 'Сергеевна', '+996500000037', 'pass37', 'Логист', 'USER', 'user37',
     13, 23, 10, '121', 'Логистика', 18),

    ('acc038', '100038', 'alexey.morozov38@example.com', 'Алексей', '2020-12-01', 'A000038', '1C0038',
     'Автосгенерированный сотрудник', 'Морозов', 'Владимирович', '+996500000038', 'pass38', 'Инженер-программист', 'USER', 'user38',
     14, 24, 10, '112', 'Отдел разработки', 1),

    ('acc039', '100039', 'elena.smirnova39@example.com', 'Елена', '2017-11-05', 'A000039', '1C0039',
     'Автосгенерированный сотрудник', 'Смирнова', 'Николаевна', '+996500000039', 'pass39', 'Финансовый директор', 'ADMIN', 'admin39',
     20, 30, 10, '215', 'Финансовый отдел', 3),

    ('acc040', '100040', 'ivan.fedorov40@example.com', 'Иван', '2016-03-17', 'A000040', '1C0040',
     'Автосгенерированный сотрудник', 'Федоров', 'Андреевич', '+996500000040', 'pass40', 'Системный администратор', 'USER', 'user40',
     15, 27, 12, '220', 'IT отдел', 1),

    ('acc041', '100041', 'marina.vasilieva41@example.com', 'Марина', '2019-08-23', 'A000041', '1C0041',
     'Автосгенерированный сотрудник', 'Васильева', 'Ивановна', '+996500000041', 'pass41', 'Специалист по кадрам', 'USER', 'user41',
     13, 22, 9, '109', 'HR отдел', 2),

    ('acc042', '100042', 'dmitry.baranov42@example.com', 'Дмитрий', '2020-05-10', 'A000042', '1C0042',
     'Автосгенерированный сотрудник', 'Баранов', 'Николаевич', '+996500000042', 'pass42', 'Разработчик', 'USER', 'user42',
     14, 25, 11, '112', 'Отдел разработки', 1),

    ('acc043', '100043', 'svetlana.egorova43@example.com', 'Светлана', '2017-09-30', 'A000043', '1C0043',
     'Автосгенерированный сотрудник', 'Егорова', 'Васильевна', '+996500000043', 'pass43', 'Бухгалтер', 'USER', 'user43',
     15, 26, 11, '204', 'Бухгалтерия', 4),

    ('acc044', '100044', 'sergey.kalinichenko44@example.com', 'Сергей', '2018-01-15', 'A000044', '1C0044',
     'Автосгенерированный сотрудник', 'Калиниченко', 'Петрович', '+996500000044', 'pass44', 'Менеджер по продажам', 'USER', 'user44',
     12, 22, 10, '102', 'Отдел продаж', 5),

    ('acc045', '100045', 'olga.zueva45@example.com', 'Ольга', '2021-02-28', 'A000045', '1C0045',
     'Автосгенерированный сотрудник', 'Зуева', 'Алексеевна', '+996500000045', 'pass45', 'Аналитик', 'USER', 'user45',
     13, 24, 11, '215', 'Аналитический отдел', 13),

    ('acc046', '100046', 'viktor.nikulin46@example.com', 'Виктор', '2019-06-12', 'A000046', '1C0046',
     'Автосгенерированный сотрудник', 'Никулин', 'Владимирович', '+996500000046', 'pass46', 'Инженер', 'USER', 'user46',
     14, 26, 12, '210', 'Инженерный отдел', 20),

    ('acc047', '100047', 'irina.koroleva47@example.com', 'Ирина', '2017-04-25', 'A000047', '1C0047',
     'Автосгенерированный сотрудник', 'Королева', 'Игоревна', '+996500000047', 'pass47', 'Менеджер по закупкам', 'USER', 'user47',
     15, 25, 10, '107', 'Отдел закупок', 8),

    ('acc048', '100048', 'andrey.titov48@example.com', 'Андрей', '2020-09-10', 'A000048', '1C0048',
     'Автосгенерированный сотрудник', 'Титов', 'Павлович', '+996500000048', 'pass48', 'Системный аналитик', 'USER', 'user48',
     12, 22, 9, '118', 'Аналитика', 13),

    ('acc049', '100049', 'marina.ivanova49@example.com', 'Марина', '2018-11-05', 'A000049', '1C0049',
     'Автосгенерированный сотрудник', 'Иванова', 'Алексеевна', '+996500000049', 'pass49', 'Юрист', 'USER', 'user49',
     13, 23, 10, '108', 'Юридический отдел', 6),

    ('acc050', '100050', 'sergey.petrov50@example.com', 'Сергей', '2019-07-20', 'A000050', '1C0050',
     'Автосгенерированный сотрудник', 'Петров', 'Дмитриевич', '+996500000050', 'pass50', 'Руководитель отдела', 'ADMIN', 'admin50',
     18, 30, 12, '119', 'Руководство', 9);


INSERT INTO departments (id, name) VALUES
                                       (1, 'IT-отдел'),
                                       (2, 'HR'),
                                       (3, 'Финансовый отдел'),
                                       (4, 'Отдел логистики'),
                                       (5, 'Отдел продаж'),
                                       (6, 'Юридический отдел'),
                                       (7, 'Маркетинговый отдел'),
                                       (8, 'Отдел сопровождения'),
                                       (9, 'Отдел технической поддержки'),
                                       (10, 'Отдел разработки'),
                                       (11, 'Отдел тестирования'),
                                       (12, 'Отдел DevOps'),
                                       (13, 'Аналитический отдел'),
                                       (14, 'Операционный отдел'),
                                       (15, 'Отдел снабжения'),
                                       (16, 'Производственный отдел'),
                                       (17, 'Учебный центр'),
                                       (18, 'Отдел качества'),
                                       (19, 'PR-отдел'),
                                       (20, 'Клиентская поддержка'),
                                       (21, 'Отдел планирования'),
                                       (22, 'IT-безопасность'),
                                       (23, 'Контактный центр'),
                                       (24, 'Административный отдел'),
                                       (25, 'Секретариат'),
                                       (26, 'Коммерческий отдел'),
                                       (27, 'Служба эксплуатации');
